LabZDjee/rst-generator/CubeIDE-TPC-Test-Bench-703885-01.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32L0
ProjectManager.MainLocation=Core/Src
PA0-CK_IN.GPIO_Label=PWM out
PA0-CK_IN.GPIOParameters=GPIO_Label
RCC.USART1Freq_Value=2097000
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32L011K4Tx
TIM21.IPParameters=Period
RCC.PLLCLKFreq_Value=8000000
VP_IWDG_VS_IWDG.Mode=IWDG_Activate
PA14.GPIO_Label=TCK
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_TIM2_Init-TIM2-false-HAL-true,4-MX_TIM21_Init-TIM21-false-HAL-true,5-MX_IWDG_Init-IWDG-false-HAL-true
RCC.RTCFreq_Value=37000
PA3.GPIOParameters=GPIO_Label
PA6.GPIO_Label=S push-pull
PB0.GPIO_Label=PWM selector
PB6.GPIO_Label=S off
RCC.USART2Freq_Value=8000000
NVIC.SVC_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.48CLKFreq_Value=24000000
PA2.GPIOParameters=GPIO_Label
PinOutPanel.RotationAngle=0
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x200
PB5.GPIOParameters=GPIO_PuPd,GPIO_Label
Mcu.IP4=TIM2
RCC.FCLKCortexFreq_Value=8000000
Mcu.IP5=TIM21
Mcu.IP2=RCC
Mcu.IP3=SYS
PA15.GPIO_Label=VCP_RX
PB4.GPIOParameters=GPIO_PuPd,GPIO_Label
Mcu.IP0=IWDG
Mcu.IP1=NVIC
TIM21.Period=26667
Mcu.UserConstants=
Mcu.ThirdPartyNb=0
RCC.HCLKFreq_Value=8000000
Mcu.IPNb=6
TIM2.IPParameters=Channel-PWM Generation1 CH1,Period,Pulse-PWM Generation1 CH1,OC1Preload_PWM
ProjectManager.PreviousToolchain=
RCC.APB2TimFreq_Value=8000000
PB6.Signal=GPIO_Input
Mcu.Pin6=PA4
VP_TIM2_VS_ClockSourceINT.Signal=TIM2_VS_ClockSourceINT
Mcu.Pin7=PA5
Mcu.Pin8=PA6
Mcu.Pin9=PA7
RCC.AHBFreq_Value=8000000
Mcu.Pin0=PC14-OSC32_IN
Mcu.Pin1=PC15-OSC32_OUT
GPIO.groupedBy=Expand Peripherals
Mcu.Pin2=PA0-CK_IN
Mcu.Pin3=PA1
Mcu.Pin4=PA2
Mcu.Pin5=PA3
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=8000000
PA4.Locked=true
NVIC.SysTick_IRQn=true\:0\:0\:true\:false\:true\:true\:true
RCC.PLLMUL=RCC_PLLMUL_4
PB0.GPIO_ModeDefaultEXTI=GPIO_MODE_IT_RISING_FALLING
ProjectManager.FirmwarePackage=STM32Cube FW_L0 V1.12.0
PA0-CK_IN.Signal=S_TIM2_CH1
MxDb.Version=DB.6.0.21
PB0.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultEXTI
PA1.GPIOParameters=GPIO_Label
ProjectManager.BackupPrevious=false
PC14-OSC32_IN.Mode=LSE-External-Oscillator
RCC.VCOInputFreq_Value=4000000
PA14.Mode=Serial_Wire
File.Version=6
PB3.GPIOParameters=GPIO_Label
SH.S_TIM2_CH1.ConfNb=1
PB7.Signal=GPIO_Input
TIM2.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
PB6.Locked=true
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB6.GPIOParameters=GPIO_PuPd,GPIO_Label
ProjectManager.HalAssertFull=false
PB0.Locked=true
ProjectManager.ProjectName=CubeIDE-TPC-Test-Bench-703885-01
PA13.GPIOParameters=GPIO_Label
PB7.GPIO_Label=T off
Mcu.Package=LQFP32
PA6.Signal=GPIO_Output
PA5.Locked=true
PA7.Locked=true
PA14.Locked=true
ProjectManager.ToolChainLocation=
PA2.GPIO_Label=VCP_TX
RCC.LSI_VALUE=37000
SH.GPXTI0.0=GPIO_EXTI0
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
IWDG.Reload=867
PA15.Signal=USART2_RX
PA5.GPIOParameters=GPIO_Label
PB5.GPIO_Label=R off
RCC.APB1TimFreq_Value=8000000
PA4.GPIO_Label=R relay
ProjectManager.CustomerFirmwarePackage=
TIM2.OC1Preload_PWM=DISABLE
PC14-OSC32_IN.Locked=true
RCC.HSI48_VALUE=48000000
RCC.LPTIMFreq_Value=8000000
PB3.Locked=true
PB4.Signal=GPIO_Input
PA3.Signal=GPIO_Output
VP_TIM21_VS_ClockSourceINT.Signal=TIM21_VS_ClockSourceINT
RCC.TIMFreq_Value=8000000
PA2.Locked=true
PB3.GPIO_Label=LD3 [Green]
PA6.GPIOParameters=GPIO_Label
RCC.MSI_VALUE=2097000
PB7.GPIO_PuPd=GPIO_PULLUP
PC15-OSC32_OUT.Mode=LSE-External-Oscillator
ProjectManager.ProjectFileName=CubeIDE-TPC-Test-Bench-703885-01.ioc
SH.S_TIM2_CH1.0=TIM2_CH1,PWM Generation1 CH1
PA15.GPIOParameters=GPIO_Label
Mcu.PinsNb=23
ProjectManager.NoMain=false
RCC.LPUARTFreq_Value=8000000
PB6.GPIO_PuPd=GPIO_PULLUP
SH.GPXTI0.ConfNb=1
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
PC14-OSC32_IN.Signal=RCC_OSC32_IN
RCC.TimerFreq_Value=8000000
boardIOC=true
RCC.FamilyName=M
TIM2.Pulse-PWM\ Generation1\ CH1=400
RCC.WatchDogFreq_Value=37000
PA13.Signal=SYS_SWDIO
RCC.HSI16_VALUE=16000000
PA15.Locked=true
PC15-OSC32_OUT.Locked=true
ProjectManager.TargetToolchain=STM32CubeIDE
PB7.GPIOParameters=GPIO_PuPd,GPIO_Label
PB5.Locked=true
PB4.GPIO_PuPd=GPIO_PULLUP
ProjectManager.RegisterCallBack=
PC15-OSC32_OUT.Signal=RCC_OSC32_OUT
PA1.Signal=GPIO_Output
PA5.Signal=GPIO_Output
RCC.MCOPinFreq_Value=8000000
board=NUCLEO-L011K4
RCC.VCOOutputFreq_Value=16000000
ProjectManager.LastFirmware=true
RCC.HSIRCDiv=4
RCC.APB2Freq_Value=8000000
MxCube.Version=6.2.1
VP_TIM21_VS_ClockSourceINT.Mode=Internal
PB4.GPIO_Label=Reversed Ph
VP_TIM2_VS_ClockSourceINT.Mode=Internal
RCC.I2C1Freq_Value=8000000
RCC.LCDFreq_Value=37000
RCC.ADCFreq_Value=4000000
PA1.GPIO_Label=T relay
VP_SYS_VS_Systick.Mode=SysTick
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.TIM21_IRQn=true\:0\:0\:false\:false\:true\:true\:true
PA4.GPIOParameters=GPIO_Label
TIM2.Period=1600
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
RCC.IPParameters=48CLKFreq_Value,ADCFreq_Value,AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI16_VALUE,HSI48_VALUE,HSIRCDiv,HSI_VALUE,I2C1Freq_Value,LCDFreq_Value,LPTIMFreq_Value,LPUARTFreq_Value,LSI_VALUE,MCOPinFreq_Value,MSI_VALUE,PLLCLKFreq_Value,PLLMUL,PWRFreq_Value,RTCFreq_Value,RTCHSEDivFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,TIMFreq_Value,TimerFreq_Value,USART1Freq_Value,USART2Freq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,WatchDogFreq_Value
IWDG.IPParameters=Prescaler,Window,Reload
ProjectManager.AskForMigrate=true
Mcu.Name=STM32L011K(3-4)Tx
RCC.RTCHSEDivFreq_Value=4000000
PA13.GPIO_Label=TMS
PA2.Signal=USART2_TX
ProjectManager.UnderRoot=true
ProjectManager.CoupleFile=false
PB4.Locked=true
PB3.Signal=GPIO_Output
PA4.Signal=GPIO_Output
RCC.SYSCLKFreq_VALUE=8000000
PB5.Signal=GPIO_Input
Mcu.Pin22=VP_TIM21_VS_ClockSourceINT
PA1.Locked=true
PA7.GPIO_Label=R push-pull
Mcu.Pin20=VP_SYS_VS_Systick
PA3.Locked=true
Mcu.Pin21=VP_TIM2_VS_ClockSourceINT
PA5.GPIO_Label=T push-pull
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
PA14.GPIOParameters=GPIO_Label
PB5.GPIO_PuPd=GPIO_PULLUP
PA13.Locked=true
ProjectManager.CompilerOptimize=6
VP_IWDG_VS_IWDG.Signal=IWDG_VS_IWDG
PA14.Signal=SYS_SWCLK
ProjectManager.HeapSize=0x020
Mcu.Pin15=PB4
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PB5
Mcu.Pin13=PA15
Mcu.Pin14=PB3
Mcu.Pin19=VP_IWDG_VS_IWDG
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PB6
RCC.HSI_VALUE=4000000
Mcu.Pin18=PB7
Mcu.Pin11=PA13
Mcu.Pin12=PA14
Mcu.Pin10=PB0
IWDG.Prescaler=IWDG_PRESCALER_64
PB7.Locked=true
RCC.PWRFreq_Value=8000000
RCC.APB1Freq_Value=8000000
PB0.Signal=GPXTI0
IWDG.Window=4095
PA7.GPIOParameters=GPIO_Label
ProjectManager.DeviceId=STM32L011K4Tx
ProjectManager.LibraryCopy=1
PB0.GPIO_PuPd=GPIO_PULLUP
PA3.GPIO_Label=S relay
PA7.Signal=GPIO_Output
NVIC.EXTI0_1_IRQn=true\:0\:0\:false\:false\:true\:true\:true
PA6.Locked=true
isbadioc=false
